app/controllers/article_controller.rb

    def index
        #render text: 'index'
        created_data = Article.maximum('created_at')
        @articles = Article.where(created_at: created_data).select(:title, :link, :post_date, :image_url, :category_id)
---
SELECT MAX("articles"."created_at") FROM "articles"
SELECT "articles"."title", "articles"."link", "articles"."post_date", "articles"."image_url", "articles"."category_id" FROM "articles" WHERE "articles"."created_at" = $1  [["created_at", 2017-01-01 15:16:54 UTC]]